turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2A.atdf
      <value-group name="AST_IER__PER0">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IER__PER1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IER__READY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Enable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__ALARM0">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__ALARM1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__CLKRDY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__OVF">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
      <value-group name="AST_IDR__PER0">
        <value name="0" caption="No effet" value="0"/>
        <value name="1" caption="Disalbe interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__PER1">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IDR__READY">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable interrupt" value="1"/>
      </value-group>
      <value-group name="AST_IMR__ALARM0">
        <value name="0" caption="Interupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__ALARM1">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__CLKRDY">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__OVF">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="AST_IMR__PER0">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__PER1">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_IMR__READY">
        <value name="0" caption="Interrupt is disabled" value="0"/>
        <value name="1" caption="Interrupt is enabled" value="1"/>
      </value-group>
      <value-group name="AST_WER__ALARM0">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__ALARM1">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__OVF">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__PER0">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_WER__PER1">
        <value name="0" caption="The corresponing event will not wake up the CPU from sleep mode" value="0"/>
        <value name="1" caption="The corresponding event will wake up the CPU from sleep mode" value="1"/>
      </value-group>
      <value-group name="AST_CLOCK__CEN">
        <value name="0" caption="The clock is disabled" value="0"/>
        <value name="1" caption="The clock is enabled" value="1"/>
      </value-group>
      <value-group name="AST_CLOCK__CSSEL">
        <value name="SLOWCLOCK" caption="Slow clock" value="0"/>
        <value name="32KHZCLK" caption="32 kHz clock" value="1"/>
        <value name="PBCLOCK" caption="PB clock" value="2"/>
        <value name="GCLK" caption="Generic clock" value="3"/>
        <value name="1KHZCLK" caption="1kHz clock from 32 kHz oscillator" value="4"/>
      </value-group>
      <value-group name="AST_PARAMETER__DT">
        <value name="OFF" caption="Digital tuner off" value="0"/>
        <value name="ON" caption="Digital tuner on" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__DTEXPWA">
        <value name="0" caption="Digital tuner exponent is a constant value. Writes to EXP bitfield in DTR will be discarded." value="0"/>
        <value name="1" caption="Digital tuner exponent is chosen by writing to EXP bitfield in DTR" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__NUMAR">
        <value name="ZERO" caption="No alarm comparators" value="0"/>
        <value name="ONE" caption="One alarm comparator" value="1"/>
        <value name="TWO" caption="Two alarm comparators" value="2"/>
      </value-group>
      <value-group name="AST_PARAMETER__NUMPIR">
        <value name="ONE" caption="One periodic comparator" value="0"/>
        <value name="TWO" caption="Two periodic comparators" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__PIR0WA">
        <value name="0" caption="Periodic alarm prescaler 0 tapping is a constant value. Writes to INSEL bitfield in PIR0 will be discarded." value="0"/>
        <value name="1" caption="Periodic alarm prescaler 0 tapping is chosen by writing to INSEL bitfield in PIR0" value="1"/>
      </value-group>
      <value-group name="AST_PARAMETER__PIR1WA">
        <value name="0" caption="Writes to PIR1 will be discarded" value="0"/>
        <value name="1" caption="PIR1 can be written" value="1"/>
      </value-group>
    </module>
    <module name="BPM" id="I7197" version="1.2.0" caption="Backup Power Manager">
      <register-group name="BPM" caption="Backup Power Manager">
        <register name="IER" offset="0x0" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Enable" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Enable" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0x4" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Disable" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Disable" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Mask" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Mask" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="PSOK" caption="Power Scaling OK Interrupt Status" mask="0x1"/>
          <bitfield name="AE" caption="Access Error Interrupt Status" mask="0x80000000"/>
        </register>
