turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2A.atdf
        <register name="PMR2C" offset="0x38" rw="W" size="4" access-size="4" atomic-op="clear:PMR2" caption="Peripheral Mux Register 2 - Clear">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 2" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 2" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 2" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 2" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 2" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 2" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 2" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 2" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 2" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 2" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 2" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 2" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 2" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 2" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 2" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 2" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 2" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 2" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 2" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 2" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 2" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 2" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 2" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 2" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 2" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 2" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 2" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 2" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 2" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 2" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 2" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 2" mask="0x80000000"/>
        </register>
        <register name="PMR2T" offset="0x3C" rw="W" size="4" access-size="4" atomic-op="toggle:PMR2" caption="Peripheral Mux Register 2 - Toggle">
          <bitfield name="P0" caption="Peripheral Multiplexer Select bit 2" mask="0x1"/>
          <bitfield name="P1" caption="Peripheral Multiplexer Select bit 2" mask="0x2"/>
          <bitfield name="P2" caption="Peripheral Multiplexer Select bit 2" mask="0x4"/>
          <bitfield name="P3" caption="Peripheral Multiplexer Select bit 2" mask="0x8"/>
          <bitfield name="P4" caption="Peripheral Multiplexer Select bit 2" mask="0x10"/>
          <bitfield name="P5" caption="Peripheral Multiplexer Select bit 2" mask="0x20"/>
          <bitfield name="P6" caption="Peripheral Multiplexer Select bit 2" mask="0x40"/>
          <bitfield name="P7" caption="Peripheral Multiplexer Select bit 2" mask="0x80"/>
          <bitfield name="P8" caption="Peripheral Multiplexer Select bit 2" mask="0x100"/>
          <bitfield name="P9" caption="Peripheral Multiplexer Select bit 2" mask="0x200"/>
          <bitfield name="P10" caption="Peripheral Multiplexer Select bit 2" mask="0x400"/>
          <bitfield name="P11" caption="Peripheral Multiplexer Select bit 2" mask="0x800"/>
          <bitfield name="P12" caption="Peripheral Multiplexer Select bit 2" mask="0x1000"/>
          <bitfield name="P13" caption="Peripheral Multiplexer Select bit 2" mask="0x2000"/>
          <bitfield name="P14" caption="Peripheral Multiplexer Select bit 2" mask="0x4000"/>
          <bitfield name="P15" caption="Peripheral Multiplexer Select bit 2" mask="0x8000"/>
          <bitfield name="P16" caption="Peripheral Multiplexer Select bit 2" mask="0x10000"/>
          <bitfield name="P17" caption="Peripheral Multiplexer Select bit 2" mask="0x20000"/>
          <bitfield name="P18" caption="Peripheral Multiplexer Select bit 2" mask="0x40000"/>
          <bitfield name="P19" caption="Peripheral Multiplexer Select bit 2" mask="0x80000"/>
          <bitfield name="P20" caption="Peripheral Multiplexer Select bit 2" mask="0x100000"/>
          <bitfield name="P21" caption="Peripheral Multiplexer Select bit 2" mask="0x200000"/>
          <bitfield name="P22" caption="Peripheral Multiplexer Select bit 2" mask="0x400000"/>
          <bitfield name="P23" caption="Peripheral Multiplexer Select bit 2" mask="0x800000"/>
          <bitfield name="P24" caption="Peripheral Multiplexer Select bit 2" mask="0x1000000"/>
          <bitfield name="P25" caption="Peripheral Multiplexer Select bit 2" mask="0x2000000"/>
          <bitfield name="P26" caption="Peripheral Multiplexer Select bit 2" mask="0x4000000"/>
          <bitfield name="P27" caption="Peripheral Multiplexer Select bit 2" mask="0x8000000"/>
          <bitfield name="P28" caption="Peripheral Multiplexer Select bit 2" mask="0x10000000"/>
          <bitfield name="P29" caption="Peripheral Multiplexer Select bit 2" mask="0x20000000"/>
          <bitfield name="P30" caption="Peripheral Multiplexer Select bit 2" mask="0x40000000"/>
          <bitfield name="P31" caption="Peripheral Multiplexer Select bit 2" mask="0x80000000"/>
        </register>
        <register name="ODER" offset="0x40" rw="RW" size="4" access-size="4" caption="Output Driver Enable Register">
          <bitfield name="P0" caption="Output Driver Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Driver Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Driver Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Driver Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Driver Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Driver Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Driver Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Driver Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Driver Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Driver Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Driver Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Driver Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Driver Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driver Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driver Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driver Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driver Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driver Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driver Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driver Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driver Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driver Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driver Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driver Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driver Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driver Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driver Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driver Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driver Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driver Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driver Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driver Enable" mask="0x80000000"/>
        </register>
        <register name="ODERS" offset="0x44" rw="W" size="4" access-size="4" atomic-op="set:ODER" caption="Output Driver Enable Register - Set">
          <bitfield name="P0" caption="Output Driver Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Driver Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Driver Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Driver Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Driver Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Driver Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Driver Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Driver Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Driver Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Driver Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Driver Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Driver Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Driver Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driver Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driver Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driver Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driver Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driver Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driver Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driver Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driver Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driver Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driver Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driver Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driver Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driver Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driver Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driver Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driver Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driver Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driver Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driver Enable" mask="0x80000000"/>
        </register>
        <register name="ODERC" offset="0x48" rw="W" size="4" access-size="4" atomic-op="clear:ODER" caption="Output Driver Enable Register - Clear">
          <bitfield name="P0" caption="Output Driver Enable" mask="0x1"/>
          <bitfield name="P1" caption="Output Driver Enable" mask="0x2"/>
          <bitfield name="P2" caption="Output Driver Enable" mask="0x4"/>
          <bitfield name="P3" caption="Output Driver Enable" mask="0x8"/>
          <bitfield name="P4" caption="Output Driver Enable" mask="0x10"/>
          <bitfield name="P5" caption="Output Driver Enable" mask="0x20"/>
          <bitfield name="P6" caption="Output Driver Enable" mask="0x40"/>
          <bitfield name="P7" caption="Output Driver Enable" mask="0x80"/>
          <bitfield name="P8" caption="Output Driver Enable" mask="0x100"/>
          <bitfield name="P9" caption="Output Driver Enable" mask="0x200"/>
          <bitfield name="P10" caption="Output Driver Enable" mask="0x400"/>
          <bitfield name="P11" caption="Output Driver Enable" mask="0x800"/>
          <bitfield name="P12" caption="Output Driver Enable" mask="0x1000"/>
          <bitfield name="P13" caption="Output Driver Enable" mask="0x2000"/>
          <bitfield name="P14" caption="Output Driver Enable" mask="0x4000"/>
          <bitfield name="P15" caption="Output Driver Enable" mask="0x8000"/>
          <bitfield name="P16" caption="Output Driver Enable" mask="0x10000"/>
          <bitfield name="P17" caption="Output Driver Enable" mask="0x20000"/>
          <bitfield name="P18" caption="Output Driver Enable" mask="0x40000"/>
          <bitfield name="P19" caption="Output Driver Enable" mask="0x80000"/>
          <bitfield name="P20" caption="Output Driver Enable" mask="0x100000"/>
          <bitfield name="P21" caption="Output Driver Enable" mask="0x200000"/>
          <bitfield name="P22" caption="Output Driver Enable" mask="0x400000"/>
          <bitfield name="P23" caption="Output Driver Enable" mask="0x800000"/>
          <bitfield name="P24" caption="Output Driver Enable" mask="0x1000000"/>
          <bitfield name="P25" caption="Output Driver Enable" mask="0x2000000"/>
          <bitfield name="P26" caption="Output Driver Enable" mask="0x4000000"/>
          <bitfield name="P27" caption="Output Driver Enable" mask="0x8000000"/>
          <bitfield name="P28" caption="Output Driver Enable" mask="0x10000000"/>
          <bitfield name="P29" caption="Output Driver Enable" mask="0x20000000"/>
          <bitfield name="P30" caption="Output Driver Enable" mask="0x40000000"/>
          <bitfield name="P31" caption="Output Driver Enable" mask="0x80000000"/>
        </register>
