turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2A.atdf
        <register name="UDINT" offset="0x4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Device Global Interupt Register">
          <bitfield name="SUSP" caption="Suspend Interrupt" mask="0x1"/>
          <bitfield name="MSOF" caption="Micro Start of Frame Interrupt" mask="0x2"/>
          <bitfield name="SOF" caption="Start of Frame Interrupt" mask="0x4"/>
          <bitfield name="EORST" caption="End of Reset Interrupt" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake-Up Interrupt" mask="0x10"/>
          <bitfield name="EORSM" caption="End Of Resume Interrupt" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume Interrupt" mask="0x40"/>
          <bitfield name="EP0INT" caption="Endpoint 0 Interrupt" mask="0x1000"/>
          <bitfield name="EP1INT" caption="Endpoint 1 Interrupt" mask="0x2000"/>
          <bitfield name="EP2INT" caption="Endpoint 2 Interrupt" mask="0x4000"/>
          <bitfield name="EP3INT" caption="Endpoint 3 Interrupt" mask="0x8000"/>
          <bitfield name="EP4INT" caption="Endpoint 4 Interrupt" mask="0x10000"/>
          <bitfield name="EP5INT" caption="Endpoint 5 Interrupt" mask="0x20000"/>
          <bitfield name="EP6INT" caption="Endpoint 6 Interrupt" mask="0x40000"/>
          <bitfield name="EP7INT" caption="Endpoint 7 Interrupt" mask="0x80000"/>
        </register>
        <register name="UDINTCLR" offset="0x8" rw="W" size="4" access-size="4" atomic-op="clear:UDINT" initval="0x00000000" caption="Device Global Interrupt Clear Register">
          <bitfield name="SUSPC" caption="SUSP Interrupt Clear" mask="0x1"/>
          <bitfield name="MSOFC" caption="MSOF Interrupt Clear" mask="0x2"/>
          <bitfield name="SOFC" caption="SOF Interrupt Clear" mask="0x4"/>
          <bitfield name="EORSTC" caption="EORST Interrupt Clear" mask="0x8"/>
          <bitfield name="WAKEUPC" caption="WAKEUP Interrupt Clear" mask="0x10"/>
          <bitfield name="EORSMC" caption="EORSM Interrupt Clear" mask="0x20"/>
          <bitfield name="UPRSMC" caption="UPRSM Interrupt Clear" mask="0x40"/>
        </register>
        <register name="UDINTSET" offset="0xC" rw="W" size="4" access-size="4" atomic-op="set:UDINT" initval="0x00000000" caption="Device Global Interrupt Set Regsiter">
          <bitfield name="SUSPS" caption="SUSP Interrupt Set" mask="0x1"/>
          <bitfield name="MSOFS" caption="MSOF Interrupt Set" mask="0x2"/>
          <bitfield name="SOFS" caption="SOF Interrupt Set" mask="0x4"/>
          <bitfield name="EORSTS" caption="EORST Interrupt Set" mask="0x8"/>
          <bitfield name="WAKEUPS" caption="WAKEUP Interrupt Set" mask="0x10"/>
          <bitfield name="EORSMS" caption="EORSM Interrupt Set" mask="0x20"/>
          <bitfield name="UPRSMS" caption="UPRSM Interrupt Set" mask="0x40"/>
        </register>
        <register name="UDINTE" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="Device Global Interrupt Enable Register">
          <bitfield name="SUSPE" caption="SUSP Interrupt Enable" mask="0x1"/>
          <bitfield name="MSOFE" caption="MSOF Interrupt Enable" mask="0x2"/>
          <bitfield name="SOFE" caption="SOF Interrupt Enable" mask="0x4"/>
          <bitfield name="EORSTE" caption="EORST Interrupt Enable" mask="0x8"/>
          <bitfield name="WAKEUPE" caption="WAKEUP Interrupt Enable" mask="0x10"/>
          <bitfield name="EORSME" caption="EORSM Interrupt Enable" mask="0x20"/>
          <bitfield name="UPRSME" caption="UPRSM Interrupt Enable" mask="0x40"/>
          <bitfield name="EP0INTE" caption="EP0INT Interrupt Enable" mask="0x1000"/>
          <bitfield name="EP1INTE" caption="EP1INT Interrupt Enable" mask="0x2000"/>
          <bitfield name="EP2INTE" caption="EP2INT Interrupt Enable" mask="0x4000"/>
          <bitfield name="EP3INTE" caption="EP3INT Interrupt Enable" mask="0x8000"/>
          <bitfield name="EP4INTE" caption="EP4INT Interrupt Enable" mask="0x10000"/>
          <bitfield name="EP5INTE" caption="EP5INT Interrupt Enable" mask="0x20000"/>
          <bitfield name="EP6INTE" caption="EP6INT Interrupt Enable" mask="0x40000"/>
          <bitfield name="EP7INTE" caption="EP7INT Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="UDINTECLR" offset="0x14" rw="W" size="4" access-size="4" atomic-op="clear:UDINTE" initval="0x00000000" caption="Device Global Interrupt Enable Clear Register">
          <bitfield name="SUSPEC" caption="SUSP Interrupt Enable Clear" mask="0x1"/>
          <bitfield name="MSOFEC" caption="MSOF Interrupt Enable Clear" mask="0x2"/>
          <bitfield name="SOFEC" caption="SOF Interrupt Enable Clear" mask="0x4"/>
          <bitfield name="EORSTEC" caption="EORST Interrupt Enable Clear" mask="0x8"/>
          <bitfield name="WAKEUPEC" caption="WAKEUP Interrupt Enable Clear" mask="0x10"/>
          <bitfield name="EORSMEC" caption="EORSM Interrupt Enable Clear" mask="0x20"/>
          <bitfield name="UPRSMEC" caption="UPRSM Interrupt Enable Clear" mask="0x40"/>
          <bitfield name="EP0INTEC" caption="EP0INT Interrupt Enable Clear" mask="0x1000"/>
          <bitfield name="EP1INTEC" caption="EP1INT Interrupt Enable Clear" mask="0x2000"/>
          <bitfield name="EP2INTEC" caption="EP2INT Interrupt Enable Clear" mask="0x4000"/>
          <bitfield name="EP3INTEC" caption="EP3INT Interrupt Enable Clear" mask="0x8000"/>
          <bitfield name="EP4INTEC" caption="EP4INT Interrupt Enable Clear" mask="0x10000"/>
          <bitfield name="EP5INTEC" caption="EP5INT Interrupt Enable Clear" mask="0x20000"/>
          <bitfield name="EP6INTEC" caption="EP6INT Interrupt Enable Clear" mask="0x40000"/>
          <bitfield name="EP7INTEC" caption="EP7INT Interrupt Enable Clear" mask="0x80000"/>
        </register>
        <register name="UDINTESET" offset="0x18" rw="W" size="4" access-size="4" atomic-op="set:UDINTE" initval="0x00000000" caption="Device Global Interrupt Enable Set Register">
          <bitfield name="SUSPES" caption="SUSP Interrupt Enable Set" mask="0x1"/>
          <bitfield name="MSOFES" caption="MSOF Interrupt Enable Set" mask="0x2"/>
          <bitfield name="SOFES" caption="SOF Interrupt Enable Set" mask="0x4"/>
          <bitfield name="EORSTES" caption="EORST Interrupt Enable Set" mask="0x8"/>
          <bitfield name="WAKEUPES" caption="WAKEUP Interrupt Enable Set" mask="0x10"/>
          <bitfield name="EORSMES" caption="EORSM Interrupt Enable Set" mask="0x20"/>
          <bitfield name="UPRSMES" caption="UPRSM Interrupt Enable Set" mask="0x40"/>
          <bitfield name="EP0INTES" caption="EP0INT Interrupt Enable Set" mask="0x1000"/>
          <bitfield name="EP1INTES" caption="EP1INT Interrupt Enable Set" mask="0x2000"/>
          <bitfield name="EP2INTES" caption="EP2INT Interrupt Enable Set" mask="0x4000"/>
          <bitfield name="EP3INTES" caption="EP3INT Interrupt Enable Set" mask="0x8000"/>
          <bitfield name="EP4INTES" caption="EP4INT Interrupt Enable Set" mask="0x10000"/>
          <bitfield name="EP5INTES" caption="EP5INT Interrupt Enable Set" mask="0x20000"/>
          <bitfield name="EP6INTES" caption="EP6INT Interrupt Enable Set" mask="0x40000"/>
          <bitfield name="EP7INTES" caption="EP7INT Interrupt Enable Set" mask="0x80000"/>
        </register>
        <register name="UERST" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Endpoint Enable/Reset Register">
          <bitfield name="EPEN0" caption="Endpoint0 Enable" mask="0x1"/>
          <bitfield name="EPEN1" caption="Endpoint1 Enable" mask="0x2"/>
          <bitfield name="EPEN2" caption="Endpoint2 Enable" mask="0x4"/>
          <bitfield name="EPEN3" caption="Endpoint3 Enable" mask="0x8"/>
          <bitfield name="EPEN4" caption="Endpoint4 Enable" mask="0x10"/>
          <bitfield name="EPEN5" caption="Endpoint5 Enable" mask="0x20"/>
          <bitfield name="EPEN6" caption="Endpoint6 Enable" mask="0x40"/>
          <bitfield name="EPEN7" caption="Endpoint7 Enable" mask="0x80"/>
        </register>
