turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l4/atdf/ATSAM4LC2A.atdf
        <register name="UHINTSET" offset="0x40C" rw="W" size="4" access-size="4" atomic-op="set:UHINT" initval="0x00000000" caption="Host Global Interrupt Set Register">
          <bitfield name="DCONNIS" caption="DCONNI Set" mask="0x1"/>
          <bitfield name="DDISCIS" caption="DDISCI Set" mask="0x2"/>
          <bitfield name="RSTIS" caption="RSTI Set" mask="0x4"/>
          <bitfield name="RSMEDIS" caption="RSMEDI Set" mask="0x8"/>
          <bitfield name="RXRSMIS" caption="RXRSMI Set" mask="0x10"/>
          <bitfield name="HSOFIS" caption="HSOFI Set" mask="0x20"/>
          <bitfield name="HWUPIS" caption="HWUPI Set" mask="0x40"/>
        </register>
        <register name="UHINTE" offset="0x410" rw="R" size="4" access-size="4" initval="0x00000000" caption="Host Global Interrupt Enable Register">
          <bitfield name="DCONNIE" caption="DCONNI Enable" mask="0x1"/>
          <bitfield name="DDISCIE" caption="DDISCI Enable" mask="0x2"/>
          <bitfield name="RSTIE" caption="RSTI Enable" mask="0x4"/>
          <bitfield name="RSMEDIE" caption="RSMEDI Enable" mask="0x8"/>
          <bitfield name="RXRSMIE" caption="RXRSMI Enable" mask="0x10"/>
          <bitfield name="HSOFIE" caption="HSOFI Enable" mask="0x20"/>
          <bitfield name="HWUPIE" caption="HWUPI Enable" mask="0x40"/>
          <bitfield name="P0INTE" caption="P0INT Enable" mask="0x100"/>
          <bitfield name="P1INTE" caption="P1INT Enable" mask="0x200"/>
          <bitfield name="P2INTE" caption="P2INT Enable" mask="0x400"/>
          <bitfield name="P3INTE" caption="P3INT Enable" mask="0x800"/>
          <bitfield name="P4INTE" caption="P4INT Enable" mask="0x1000"/>
          <bitfield name="P5INTE" caption="P5INT Enable" mask="0x2000"/>
          <bitfield name="P6INTE" caption="P6INT Enable" mask="0x4000"/>
          <bitfield name="P7INTE" caption="P7INT Enable" mask="0x8000"/>
        </register>
        <register name="UHINTECLR" offset="0x414" rw="W" size="4" access-size="4" atomic-op="clear:UHINTE" initval="0x00000000" caption="Host Global Interrupt Enable Clear Register">
          <bitfield name="DCONNIEC" caption="DCONNIE Clear" mask="0x1"/>
          <bitfield name="DDISCIEC" caption="DDISCIE Clear" mask="0x2"/>
          <bitfield name="RSTIEC" caption="RSTIE Clear" mask="0x4"/>
          <bitfield name="RSMEDIEC" caption="RSMEDIE Clear" mask="0x8"/>
          <bitfield name="RXRSMIEC" caption="RXRSMIE Clear" mask="0x10"/>
          <bitfield name="HSOFIEC" caption="HSOFIE Clear" mask="0x20"/>
          <bitfield name="HWUPIEC" caption="HWUPIE Clear" mask="0x40"/>
          <bitfield name="P0INTEC" caption="P0INTE Clear" mask="0x100"/>
          <bitfield name="P1INTEC" caption="P1INTE Clear" mask="0x200"/>
          <bitfield name="P2INTEC" caption="P2INTE Clear" mask="0x400"/>
          <bitfield name="P3INTEC" caption="P3INTE Clear" mask="0x800"/>
          <bitfield name="P4INTEC" caption="P4INTE Clear" mask="0x1000"/>
          <bitfield name="P5INTEC" caption="P5INTE Clear" mask="0x2000"/>
          <bitfield name="P6INTEC" caption="P6INTE Clear" mask="0x4000"/>
          <bitfield name="P7INTEC" caption="P7INTE Clear" mask="0x8000"/>
        </register>
        <register name="UHINTESET" offset="0x418" rw="W" size="4" access-size="4" atomic-op="set:UHINTE" initval="0x00000000" caption="Host Global Interrupt Enable Set Register">
          <bitfield name="DCONNIES" caption="DCONNIE Set" mask="0x1"/>
          <bitfield name="DDISCIES" caption="DDISCIE Set" mask="0x2"/>
          <bitfield name="RSTIES" caption="RSTIE Set" mask="0x4"/>
          <bitfield name="RSMEDIES" caption="RSMEDIE Set" mask="0x8"/>
          <bitfield name="RXRSMIES" caption="RXRSMIE Set" mask="0x10"/>
          <bitfield name="HSOFIES" caption="HSOFIE Set" mask="0x20"/>
          <bitfield name="HWUPIES" caption="HWUPIE Set" mask="0x40"/>
          <bitfield name="P0INTES" caption="P0INTE Set" mask="0x100"/>
          <bitfield name="P1INTES" caption="P1INTE Set" mask="0x200"/>
          <bitfield name="P2INTES" caption="P2INTE Set" mask="0x400"/>
          <bitfield name="P3INTES" caption="P3INTE Set" mask="0x800"/>
          <bitfield name="P4INTES" caption="P4INTE Set" mask="0x1000"/>
          <bitfield name="P5INTES" caption="P5INTE Set" mask="0x2000"/>
          <bitfield name="P6INTES" caption="P6INTE Set" mask="0x4000"/>
          <bitfield name="P7INTES" caption="P7INTE Set" mask="0x8000"/>
        </register>
        <register name="UPRST" offset="0x41C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Pipe Reset Register">
          <bitfield name="PEN0" caption="Pipe0 Enable" mask="0x1"/>
          <bitfield name="PEN1" caption="Pipe1 Enable" mask="0x2"/>
          <bitfield name="PEN2" caption="Pipe2 Enable" mask="0x4"/>
          <bitfield name="PEN3" caption="Pipe3 Enable" mask="0x8"/>
          <bitfield name="PEN4" caption="Pipe4 Enable" mask="0x10"/>
          <bitfield name="PEN5" caption="Pipe5 Enable" mask="0x20"/>
          <bitfield name="PEN6" caption="Pipe6 Enable" mask="0x40"/>
          <bitfield name="PEN7" caption="Pipe7 Enable" mask="0x80"/>
        </register>
        <register name="UHFNUM" offset="0x420" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Host Frame Number Register">
          <bitfield name="MFNUM" caption="Micro Frame Number" mask="0x7"/>
          <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
          <bitfield name="FLENHIGH" caption="Frame Length" mask="0xFF0000"/>
        </register>
        <register name="UHSOFC" offset="0x424" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Host Start of Frame Control Register">
          <bitfield name="FLENC" caption="Frame Length Control" mask="0x3FFF"/>
          <bitfield name="FLENCE" caption="Frame Length Control Enable" mask="0x10000"/>
        </register>
        <register name="UPCFG0" offset="0x500" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG0__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG0__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG0__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG0__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPCFG1" offset="0x504" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG1__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG1__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG1__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG1__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPCFG2" offset="0x508" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG2__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG2__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG2__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG2__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
        <register name="UPCFG3" offset="0x50C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Pipe Configuration Register">
          <bitfield name="PBK" caption="Pipe Banks" mask="0x4" values="USBC_UPCFG3__PBK"/>
          <bitfield name="PSIZE" caption="Pipe Size" mask="0x70" values="USBC_UPCFG3__PSIZE"/>
          <bitfield name="PTOKEN" caption="Pipe Token" mask="0x300" values="USBC_UPCFG3__PTOKEN"/>
          <bitfield name="PTYPE" caption="Pipe Type" mask="0x3000" values="USBC_UPCFG3__PTYPE"/>
          <bitfield name="PINGEN" caption="Ping Enable" mask="0x100000"/>
          <bitfield name="BINTERVAL" caption="binterval parameter" mask="0xFF000000"/>
        </register>
